<!DOCTYPE html>
<html>
	<head>
		<title>PHP数组：数组的定义</title>
		<meta charset="utf-8"/>
	</head>
	<body>
		<?php
			/*
				数组的分类：
					索引式：下标是阿拉伯数字     $a[0] = '张三'
					关联式：下标是有意义的字符串	$stu['name'] = '张三'
			*/
			
			//索引式
			//$a = [10,20,30,40];
			
			//关联式
			//$stu['name'] = '张三';
			//$stu['sex'] = '男';
			//$stu['age'] = 18;
			
		
			//1.快捷赋值方式定义
			
			//① 不指定下标，直接定义一个索引式数组【如果定义一个数组元素，但是未指定下标，则该元素的下标会自动寻找上次所出现过的最大下标值，并在其基础之上+1】
			$a[] = 10;
			$a[] = 20;
			$a[] = 30;
			$a[5] = 40;
			unset($a[5]);
			$a[] = 50;
			
			//② 指定下标，直接定义一个索引式数组
			$b[0] = 10;
			$b[1] = 20;
			$b[2] = 30;
			$b[100] = 30;
			$b[] = 40;
			
			//③ 指定下标，直接定义一个关联式数组
			$stu['name'] = '李四';
			$stu['sex'] = '女';
			$stu['age'] = 18;
			
			
			//2.使用array语言结构定义
			
			//① 不指定下标，直接定义一个索引式数组
			$a = array(10,20,30,40);
			
			//② 指定下标，直接定义一个索引式数组
			$b = array(0=>10,1=>20,2=>30,3=>40,50,100=>100,101);
			
			//③ 指定下标，直接定义一个关联式数组
			$stu = array(
					'name'=>'王五',
					'sex'=>'男',
					'age'=>18,
					);
			
			
			//3.简洁方式定义
			//① 不指定下标，直接定义一个索引式数组
			$a = [10,20,30,40,50];
			
			//② 指定下标，直接定义一个索引式数组
			$b = [0=>10,1=>20,2=>30,3=>40,100=>100,200];
			
			//③ 指定下标，直接定义一个关联式数组
			$stu = [
					'name'=>'李四',
					'sex'=>'女',
					'age'=>18,
					];
			
			//使用数组
			var_dump($stu['name']);
			var_dump($stu['sex']);
			var_dump($stu['age']);
			
			var_dump($b[0]);
			var_dump($b[1]);
			var_dump($b[100]);
			
			//删除数组元素
			//unset($stu['age']);
			//$stu['age']=null;
			$stu['age']='';
			
			//删除整个数组
			unset($stu);
			var_dump($stu);
		?>
	</body>
</html>